IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_dcsm_bank1_z1_regs.xml
<module id="DCSM_BANK1_Z1_REGS" HW_revision="" description="DCSM BANK1 Z1 Registers">
	<register id="B1_Z1_LINKPOINTER" width="32" page="1" offset="0x0" internal="0" description="Zone 1 Link Pointer for flash BANK1">
		<bitfield id="LINKPOINTER" description="Zone1 LINK Pointer in Flash BANK1" begin="28" end="0" width="29" rwaccess="R"/>
	</register>
	<register id="B1_Z1_LINKPOINTERERR" width="32" page="1" offset="0x6" internal="0" description="Link Pointer Error for flash BANK1">
		<bitfield id="Z1_LINKPOINTERERR" description="Error to Resolve Z1 Link pointer from OTP loaded values" begin="28" end="0" width="29" rwaccess="R"/>
	</register>
	<register id="B1_Z1_GRABSECTR" width="32" page="1" offset="0x1a" internal="0" description="Zone 1 Grab Flash BANK1 Sectors Register">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0 in BANK1" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1 in BANK1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2 in BANK1" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3 in BANK1" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4 in BANK1" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5 in BANK1" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6 in BANK1" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7 in BANK1" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8 in BANK1" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9 in BANK1" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10 in BANK1" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11 in BANK1" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12 in BANK1" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13 in BANK1" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT14" description="Grab Flash Sector 14 in BANK1" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT15" description="Grab Flash Sector 15 in BANK1" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="B1_Z1_EXEONLYSECTR" width="32" page="1" offset="0x1e" internal="0" description="Zone 1 Flash BANK1 Execute_Only Sector Register">
		<bitfield id="EXEONLY_SECT0" description="Execute-Only Flash Sector 0 in Flash BANK1" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT1" description="Execute-Only Flash Sector 1 in Flash BANK1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT2" description="Execute-Only Flash Sector 2 in Flash BANK1" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT3" description="Execute-Only Flash Sector 3 in Flash BANK1" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT4" description="Execute-Only Flash Sector 4 in Flash BANK1" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT5" description="Execute-Only Flash Sector 5 in Flash BANK1" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT6" description="Execute-Only Flash Sector 6 in Flash BANK1" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT7" description="Execute-Only Flash Sector 7 in Flash BANK1" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT8" description="Execute-Only Flash Sector 8 in Flash BANK1" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT9" description="Execute-Only Flash Sector 9 in Flash BANK1" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT10" description="Execute-Only Flash Sector 10 in Flash BANK1" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT11" description="Execute-Only Flash Sector 11 in Flash BANK1" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT12" description="Execute-Only Flash Sector 12 in Flash BANK1" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT13" description="Execute-Only Flash Sector 13 in Flash BANK1" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT14" description="Execute-Only Flash Sector 14 in Flash BANK1" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT15" description="Execute-Only Flash Sector 15 in Flash BANK1" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
</module>
